
/****************************************************************************
* タイトル:  eraceString.cppのヘッダー
* ファイル名:bullet.h
* 作成者：	 芳崎大地
* 作成日：   2015/11/21
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _ERACE_STRING_H_
#define _ERACE_STRING_H_
/*******************************************************************************
* マクロ定義
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include<string>
/*******************************************************************************
* 関数名:void eraseString(std::string &str, const std::string& from, const std::string& to = ""){
*
* 引数:  std::string &str, const std::string& from, const std::string& to
* 戻り値:void、なし
* 説明	指定文字の消去、もしくは入れ替え
*
*******************************************************************************/
void eraseString(std::string &str, const std::string& from, const std::string& to = ""){
	std::string::size_type pos = 0;
	while (pos = str.find(from, pos), pos != std::string::npos) {
		str.replace(pos, from.length(), "");
		pos += to.length();
	}
}
/*******************************************************************************
* 関数名:void backEraseString(std::string &str){
*
* 引数:  std::string &str
* 戻り値:void、なし
* 説明	指定文字移行の消去
*
*******************************************************************************/
void backEraseString(std::string &str, std::string a){
	int i = 0;
	for (; i < (int)str.size(); ++i) {
		if (str[i] == *a.c_str()) break;
	}
	if (i < (int)str.size()) {
		str.erase(i, (int)str.size() - i);
	}
}

#endif