/****************************************************************************
* タイトル:  フェードの処理
* ファイル名:fade.cpp
* 作成者：	 芳崎大地
* 作成日：   2015/07/06
*******************************************************************************/
/*******************************************************************************
* 更新履歴：
*
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include"fadeController.h"
#include"fade.h"
#include"mode.h"
/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
/*******************************************************************************
* グローバル変数
*******************************************************************************/
CFade*	CFadeController::m_currentFade;
CMode*	CFadeController::m_nextMode;
/*******************************************************************************
* 関数名:void CFadeController::Init()
*
* 引数:  なし
* 戻り値:なし
* 説明 フェードコントローラクラスの初期化処理
*
*******************************************************************************/
void CFadeController::Init(){
	m_currentFade = NULL;
}
/*******************************************************************************
* 関数名:void CFadeController::Uninit()
*
* 引数:  なし
* 戻り値:なし
* 説明 フェードコントローラクラスの終了処理
*
*******************************************************************************/
void CFadeController::Uninit(){
}
/*******************************************************************************
* 関数名:void CFadeController::Update()
*
* 引数:  なし
* 戻り値:なし
* 説明 フェードコントローラクラスの更新処理
*
*******************************************************************************/
void CFadeController::Update(){
	if (m_currentFade){
		m_currentFade->Update();
		if (m_currentFade->bGetChange())	CMode::Set(m_nextMode);
		if (m_currentFade->bGetFinish())	SAFE_DELETE(m_currentFade);
	}
}
/*******************************************************************************
* 関数名:void CFadeController::Draw()
*
* 引数:  なし
* 戻り値:なし
* 説明 フェードコントローラクラスの描画処理
*
*******************************************************************************/
void CFadeController::Draw(){
	if (m_currentFade)	m_currentFade->Draw();
}
/*******************************************************************************
* 関数名:	void SetFade(CFade *fade, CMode* nextMode, float nFadeSpeed)
*
* 引数:  なし
* 戻り値:なし
* 説明 フェードコントローラクラスのセッター
*
*******************************************************************************/
void CFadeController::SetFade(CFade* fade, CMode* nextMode, float nFadeSpeed){
	if (m_currentFade == NULL){
		m_nextMode = nextMode;
		m_currentFade = fade;
		m_currentFade->Init();
		m_currentFade->SetFadeSpeed(nFadeSpeed);
	}
}
