/****************************************************************************
* タイトル:  fade.cppのヘッダー
* ファイル名:title.h
* 作成者：	 芳崎大地
* 作成日：   2016/06/26
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _FADE_H_
#define _FADE_H_
/*******************************************************************************
* マクロ定義
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "renderer.h"
/*******************************************************************************
* 列挙体の定義
*******************************************************************************/
typedef enum{
	FADE_IN,
	FADE_OUT,
	FADE_NONE
}FADE_STATE;
/*******************************************************************************
* 構造体の定義
*******************************************************************************/
//フェードクラス
class CFade{
private:
protected:
	int m_nVertexNum;
	LPDIRECT3DVERTEXBUFFER9 m_buffer;//頂点バッファへのポインタ
	bool m_bChangeMode;
	FADE_STATE m_currentFadeState;
	float m_fFadeSpeed;
	bool m_bFinish;
public:
	bool bGetFinish(){ return m_bFinish; }
	bool bGetChange(){ return m_bChangeMode; }
	FADE_STATE getFadeState(){ return m_currentFadeState; }
	CFade();
	virtual ~CFade();
	virtual void Init() = 0;
	virtual void Uninit() = 0;
	virtual void Update() = 0;
	virtual void Draw() = 0;
	void SetFadeSpeed(float fVal){ m_fFadeSpeed = fVal; }
};

#endif