/****************************************************************************
* タイトル:  guiStringヘッダー
* ファイル名:guiString.h
* 作成者：	 芳崎大地
* 作成日：   2016/05/13
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _GUI_STRING_H_
#define _GUI_STRING_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include"gui.h"
#include"renderer.h"
/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/
/*******************************************************************************
* マクロ定義
*******************************************************************************/
/*******************************************************************************
* 構造体の定義
*******************************************************************************/
/*******************************************************************************
* クラスの定義
*******************************************************************************/
class CGuiString : public CGui{
public:
	CGuiString(D3DXVECTOR3 pos, float fWidth, float fHeight, int nFontSize, std::string, char *pFilename, D3DXCOLOR col);
	~CGuiString(){ Uninit(); };
	void Init();
	void Uninit();
	void Update();
	void Draw();
	void SetString(std::string string){ m_string = string; };
	static CGuiString *Create(D3DXVECTOR3 pos, float fWidth, float fHeight, int nFontSize, std::string, char *pFilename, D3DXCOLOR col);
private:
	D3DXVECTOR3 m_pos;		//ポジション
	float		m_fWidth;	//幅
	float		m_fHeight;	//高さ
	int			m_nFontSize;
	std::string	m_string;	//表示文字列
	char* m_pFileName;
	LPD3DXFONT	m_pFont;	//フォントのワーク
	D3DXCOLOR	m_col;
	LPDIRECT3DVERTEXBUFFER9	m_bufferPolygon;	//頂点バッファ
};
#endif