/****************************************************************************
* タイトル:  sceneRectヘッダー
* ファイル名:sceneRect.h
* 作成者：	 芳崎大地
* 作成日：   2016/05/3
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _SCENE_RECT_H_
#define _SCENE_RECT_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include"scene.h"
/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/
/*******************************************************************************
* マクロ定義
*******************************************************************************/
/*******************************************************************************
* 構造体の定義
*******************************************************************************/
/*******************************************************************************
* クラスの定義
*******************************************************************************/
//シーンクラス
class CSceneRect : public CScene{
private:
	LPDIRECT3DVERTEXBUFFER9	m_bufferPolygon;	//頂点バッファ
	char					*m_pFileName;		//ファイル名
	float					m_fWidth;			//幅
	float					m_fHeight;
public:
	CSceneRect(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 scl, float fWidth, float fHeight, char *pFileName, D3DXCOLOR col){ m_bufferPolygon = NULL; m_pos = pos; m_rot = rot; m_scl = scl; m_fWidth = fWidth; m_fHeight = fHeight; m_pFileName = pFileName; m_col = col; Init(); }
	~CSceneRect(){ Uninit(); }
	void Init();
	void Uninit();
	void Draw();
	void Update();
	static CSceneRect *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 scl, float fWidth, float fHeight, char *pFileName, D3DXCOLOR col);
};

#endif