/****************************************************************************
* タイトル:  sceneBillboardヘッダー
* ファイル名:sceneBillboard.h
* 作成者：	 芳崎大地
* 作成日：   2016/05/3
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _SCENE_Billboard_H_
#define _SCENE_Billboard_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include"scene.h"
/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/
/*******************************************************************************
* マクロ定義
*******************************************************************************/
/*******************************************************************************
* 構造体の定義
*******************************************************************************/
/*******************************************************************************
* クラスの定義
*******************************************************************************/
//シーンクラス
class CSceneBillboard : public CScene{
private:
	LPDIRECT3DVERTEXBUFFER9	m_bufferPolygon;	//頂点バッファ
	char					*m_pFileName;		//ファイル名
	float					m_fWidth;
	float					m_fHeight;
public:
	CSceneBillboard(D3DXVECTOR3 pos, D3DXVECTOR3 rot, float fWidth, float fHeight, char *pFileName, D3DXCOLOR col){ m_bufferPolygon = NULL; m_pos = pos; m_rot = rot; m_fWidth = fWidth; m_fHeight = fHeight; m_pFileName = pFileName; m_col = col; Init(); }
	~CSceneBillboard(){ Uninit(); };
	void Init();
	void Uninit();
	void Draw();
	void Update();
	static CSceneBillboard *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, float fWidth, float fHeight, char *pFileName, D3DXCOLOR col);
};

#endif