/****************************************************************************
* タイトル:  buttonヘッダー
* ファイル名:button.h
* 作成者：	 芳崎大地
* 作成日：   2016/05/13
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _SCORE_H_
#define _SCORE_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include"gui.h"
#include"renderer.h"
#include"number.h"
/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/
/*******************************************************************************
* マクロ定義
*******************************************************************************/
/*******************************************************************************
* 構造体の定義
*******************************************************************************/
/*******************************************************************************
* クラスの定義
*******************************************************************************/
class CScore : public CGui{
public:
	CScore(D3DXVECTOR3 pos, float fWidth, float fHeight, int nNum, int nDidit, char* fileName);
	~CScore();
	void Set(int nNum){ m_nScore = nNum; }
	void Add(int nNum){ m_nScore += nNum; }
	void Sub(int nNum){ m_nScore -= nNum; }
	int	 Get(){ return m_nScore; }
	void Init();
	void Uninit();
	void Update();
	void Draw();
	static CScore *Create(D3DXVECTOR3 pos, float fWidth, float fHeight, int nNum, int nDidit, char* fileName);
private:
	D3DXVECTOR3 m_pos;
	float		m_fWidth;
	float		m_fHeight;
	int			m_nScore;
	int			m_nDigit;
	std::vector<CNumber*> m_vecNum;
};
#endif